<section class="git_section">
	<h2 class="git_section-h2">Общие команды</h2>
<div class="git_div_info">
<pre  class="git_div_info-pre">
//======СОЗДАТЬ===========//
Репозиторий(
создает подкаталог .git 
содержащий все необходимые
файлы репозитория
[основу Git-репозитория]
на ветке macter)
--------
git init
--------
=============END===========
</pre>
<pre  class="git_div_info-pre">
=======КОНТРОЛЬ=======//
Статистика_в каком
состояние репозиторий
----------
git status
-----------
упрощенный вывод
--------------
git status -s
--------------
------------------
git status --short
-------------------
Индексация_в каком
состоянии файлы
--------
git diff
--------
==========END=========
</pre>
<pre  class="git_div_info-pre">
==========СБРОС===========//
Востановить репозиторий
в первоначальную версию
------------------
git reset --hard
------------------
Востановить репозиторий
до указанного коммита
(удаляет все последующих
коммиты безвозвратно)
------------------------------
git reset --hard [хеш коммита]
------------------------------
===========END=============
</pre>
<pre  class="git_div_info-pre">
=====ПРОСМОТР======//
---------
git show
---------
---------------------
git show [хеш_коммита]
----------------------
=========END=========
</pre>
<pre  class="git_div_info-pre">
=======ПЕРЕХОД===========//
Переход на ветку мастер
-------------------
git checkout master
-------------------
Переход на ветку
--------------------------
git checkout [name_branch]
---------------------------
Перейти в репозитории
до указанного коммита
(сохранив при этом более
новые коммиты)
--------------------------
git checkout [хеш коммита]
--------------------------
Перейти в репозиторий
по комментарию
указанного в коммите
(сохранив при этом
более новые коммиты)
------------------------------
$ git checkout :/"комментарий"
-------------------------------
Переход на 5-ое
с конца сохраненное
состояние
---------------------
git checkout master~5
---------------------
============END=========
</pre>
<pre  class="git_div_info-pre">
================КОПИЯ==============//
Сделать копию
репозитория
---------
git clone
---------
вариант_1
---------------------
git clone git://(url)
---------------------
....................................................
пример:копия каталог --> grit
git clone git://github.com/schacon/grit.git
////////////////////////////////////////////////////
пример:копия указанный каталог "m_dhunga"
git clone git://github.com/schacon/grit.git m_dhunga
.....................................................
---------
вариант_2
-------------------------
git clone http(s)://(url)
-------------------------
..............................................
пример:
git clone http://koserli.com/GitHub/dhunga.git
..............................................
---------
вариант_3
использование
протокола передачи SSH
-------------------------------
git clone user@server:/path.git
-------------------------------
=================END=================
</pre>
</div>
</section>