<section class="git_section">
	<h2 class="git_section-h2">Снимок_Коммит</h2>
<div class="git_div_info">
<pre  class="git_div_info-pre">
//======СДЕЛАТЬ КОММИТ=======//
снимок_текущее
состояние репозитория
----------
вариант_1
коммит
+
комментарий
-----------------------
git commit -m "коммент"
-----------------------
вариант_2
индексировать
+
коммит
+
комментарий
--------------------------
git commit -a -m "коммент"
--------------------------
--------------------------
git commit -am "коммент"
--------------------------
===========END==============
</pre>
<pre  class="git_div_info-pre">
==========СРАВНИТЬ============//
Разница между коммитами
-----------------------------
git diff [commit1]..[commit2]
-----------------------------
============END===============
</pre>
<pre  class="git_div_info-pre">
========ПРОСМОТР===========//
последний коммит
на каждой из веток
--------------
git branch -v
--------------
по хешу коммита
----------------------
git show [хеш_коммита]
----------------------
последний хеш_соммита
на ветке
-------------------------
git rev-parse [name_ветка]
-------------------------
предпоследний коммит
--------------
git show HEAD^
--------------
==========END==============
</pre>
<pre  class="git_div_info-pre">
=============СЖАТИЕ==========//
сжимает в один коммит
------------------------------
git merge --no-commit --squash
-------------------------------
==============================
</pre>
<pre  class="git_div_info-pre">
========ВСТАВИТЬ=============//
вставить коммит [хеш]
в ветку master
-----------------------------
git cherry-pick [хеш_соммита]
-----------------------------
==============END============
</pre>
<pre  class="git_div_info-pre">
==========МЕТКА===========//
имя ближайшей метки
с числом коммитов
сделанных поверх
этой метки и 
частичное значения SHA-1
описываемого коммита
------------
git describe
------------
=============END============
</pre>
<pre  class="git_div_info-pre">
======ИСПРАВИТЬ======//
(историю коммитов)
изменить комментарий
последнего коммита
-------------------
git commit --amend
-------------------
отменить/изменить
снимок состояния
в коммите
-------------------
git add [name.file]
-------------------
------------------
git rm [name.file]
-------------------
-------------------
git commit --amend
-------------------
===========END========
</pre>
</div>
</section>