<section class="git_section">
	<h2 class="git_section-h2">Настройка Git</h2>
<div class="git_div_info">
<pre class="git_div_info-pre">
//======СПРАВКА======//
справочная git
-----------
git --help
-----------
варианты
что за команда
пример
--------------
git help config
--------------
git help <команда>
или
git <команда> --help
man git-<команда>
====================
</pre>
<pre class="git_div_info-pre">
====КОНФИГУРАЦИЯ==========//
конфигурационные 
файлы находятся:
первое_место()
/etc/gitconfig
чтение/запись
-------------------
git config --system
-------------------
второе_место(C:\Users\Dhun)
~/.gitconfig
-------------------
git config --global
-------------------
третье_место(в проекте)
.git/config
----------------------------
git config --file [filename]
----------------------------
просмотр конфигурации
-----------
git config
-----------
ваши используемые настройки
-----------------
git config --list
-----------------
=============================
</pre>
<pre  class="git_div_info-pre">
====================УСТАНОВИТЬ================//
установка имени
--------------------------------------
git config --global user.name "Dhunga"
---------------------------------------
установка адреса
-----------------------------------------------
git config --global user.email dhunga@yandex.ru
-----------------------------------------------
================================================
</pre>
<pre  class="git_div_info-pre">
=======ПРОВЕРИТЬ======//
проверить по ключу
----------------------
git config <user.name>
----------------------
======================
</pre>
</div>
</section>