<section class="git_section">
	<h2 class="git_section-h2">История</h2>
<div class="git_div_info">
<pre  class="git_div_info-pre">
//=============ЛОГ=============//
Создать файл
с списком изменений
-------------------
git log > ChangeLog
-------------------
cписок последних
коммитов и их хеши SHA1
---------
git log
---------
сокращенный список всех
операций в репозитории
----------------
git reflog
-----------------
лимитированый список
с использованием
специальных обозначений
------------
git log 
-n[число]
--max-count=[число]
--skip=[число]
------------
просмотр истории с хеша
последнего коммита
-------------------------------
git log --stat [commit(SHA-1)]
-------------------------------
список сокращенных
хешей+комментарий
------------------
git log --oneline
------------------
-------------------------------------------
git log --oneline --decorate --graph --all
-------------------------------------------
-----------------------------------------
git log --abbrev-commit --pretty=oneline
-----------------------------------------
---------------------------------------
git log --pretty=format:'%h %s' --graph
----------------------------------------
информация
ссылочного лога
-----------------
git log -g master
------------------
================END==========
</pre>
<pre  class="git_div_info-pre">

</pre>
<pre  class="git_div_info-pre">

</pre>
<pre  class="git_div_info-pre">

</pre>
</div>
</section>